Examinator/src/Documents/СессияЭлектронногоРесурсаСУЗ/СессияЭлектронногоРесурсаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СессияЭлектронногоРесурсаСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаВопросыСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовВопросовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяСессия</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСессии</name>
    <type>
      <types>EnumRef.ТипыСессийЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТекстовые</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеТекстовые</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ПрохожденияЭлектронныхРесурсовСУЗ/ПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрохожденияЭлектронныхРесурсовСУЗ</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлеерВебКабинета</name>
    <type>
      <types>EnumRef.ПлеерыКурсовВебКабинетаСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОтветыНаВопросыСУЗ/ОтветыНаВопросыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветыНаВопросыСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПсихологическийВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованаПодсказка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазвернутыйОтветПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВыбранныеВариантыОтветовВопросовСУЗ/ВыбранныеВариантыОтветовВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыбранныеВариантыОтветовВопросовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Выбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерныйВыбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерныйНеВыбран</name>
    <comment>Равно Истина, если вариант верный, но не был выбран пользователем.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибочныйВыбран</name>
    <comment>Равно Истина, если вариант является дистрактором и был выбран.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибочныйНеВыбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантОтвета</name>
    <type>
      <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВопросыТестированийСУЗ/ВопросыТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВопросыТестированийСУЗ</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПодборки</name>
    <type>
      <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ТестыНаПроверкуСУЗ/ТестыНаПроверкуСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТестыНаПроверкуСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПовторноеПрохождениеЭлектронныхРесурсовСУЗ/ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/СессияЭлектронногоРесурсаСУЗ/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Перем ТаблицаСтатистикиПараметровSCORM Экспорт;
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПрохожденияЭлектронныхРесурсовСУЗ.Записывать = Истина;
	Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Записывать = Истина;
	Движения.ОтветыНаВопросыСУЗ.Записывать = Истина;
	Движения.ВыбранныеВариантыОтветовВопросовСУЗ.Записывать = Истина;	
	Движения.ВопросыТестированийСУЗ.Записывать = Истина;
	Движения.ТестыНаПроверкуСУЗ.Записывать = Истина;
	Движения.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.Записывать = Истина;	
	
	Если ЭлектронныеРесурсыПереопределяемый.ОбучениеОтменено(Отменено, ПрохождениеОбучения, Задание) Тогда
		Возврат;
	КонецЕсли;	
	
	СформироватьДвижения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура СформироватьДвижения() Экспорт
		
	СтруктураДанных = Данные.Получить();
	
	Если ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning Тогда
		
		Движение = Движения.ПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
		
		Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
		Движение.Пользователь = Пользователь;
		Движение.ПрохождениеОбучения = ПрохождениеОбучения;
		Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
		Движение.ПлеерВебКабинета = Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Встроенный;
		
		Если НЕ ТипЗнч(СтруктураДанных) = Тип("ФиксированнаяСтруктура")
			ИЛИ НЕ СтруктураДанных.Свойство("uuid") Тогда
		
			ВызватьИсключение НСтр("ru = 'Неверный формат структуры данных веб-кабинета'")
		
		КонецЕсли;
		
		ИдентификаторАктивности = Новый УникальныйИдентификатор(СтруктураДанных.uuid);
	
		ВсеДанныеИзучения = РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.ВсеДанныеИзучения(ИдентификаторАктивности, ЭлектронныйРесурс);
		
		Если ВсеДанныеИзучения.Свойство("score") Тогда			
			
			Движение.Результат = ВсеДанныеИзучения.score;
			
			Если Движение.Результат > 100 Тогда
				Движение.Результат = 100;
			КонецЕсли;
			
		КонецЕсли;
				
		Движение.Завершено = ВсеДанныеИзучения.complete;
		
		Движение.КонтрольнаяСумма = КонтрольнаяСумма;
		

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеСУЗ.Ссылка КАК Ссылка,
			|	СодержаниеСУЗ.СсылкаНаЭлемент КАК СсылкаНаЭлемент
			|ИЗ
			|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
			|ГДЕ
			|	СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
			|	И СодержаниеСУЗ.ЭтоГруппа = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
		ТаблицаЭлементовСодержания = Запрос.Выполнить().Выгрузить();
		
		ТаблицаЭлементовСодержания.Колонки.Добавить("ИдентификаторЭлемента", Новый ОписаниеТипов("УникальныйИдентификатор"));
		
		Для каждого СтрокаТЭС Из ТаблицаЭлементовСодержания Цикл		
			СтрокаТЭС.ИдентификаторЭлемента = СтрокаТЭС.СсылкаНаЭлемент.УникальныйИдентификатор();			
		КонецЦикла;
		
		Для каждого ЭлементСтруктуры Из ВсеДанныеИзучения Цикл
			
			Если НЕ СтрНачинаетсяС(ЭлементСтруктуры.Ключ, "activity_") Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеАктивности = ЭлементСтруктуры.Значение;
			
			СтрокаТЭС = ТаблицаЭлементовСодержания.Найти(Новый УникальныйИдентификатор(ДанныеАктивности.slide), "ИдентификаторЭлемента");
				
			Если СтрокаТЭС = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			
			ЭлементСодержания = СтрокаТЭС.Ссылка; 
			СсылкаНаЭлемент   = СтрокаТЭС.СсылкаНаЭлемент;
			ВремяПрохожденияВСекундах = ?(ЗначениеЗаполнено(ДанныеАктивности.end), ДанныеАктивности.end - ДанныеАктивности.start, ТекущаяДатаСеанса() - ДанныеАктивности.start);
			
			Если ДанныеАктивности.type = "STATIC" Тогда
				
				Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
		
				Движение.Период = ДанныеАктивности.start;
				Движение.Пользователь = Пользователь;
				Движение.ПрохождениеОбучения = ПрохождениеОбучения;
				ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);
				Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
				Движение.ЭлементСодержания = ЭлементСодержания;
					
				Если ДанныеАктивности.complete Тогда
					Движение.Результат = 100;
				Иначе
					Движение.Результат = 0;
				КонецЕсли;
				
				Движение.ВремяПрохожденияВСекундах = ВремяПрохожденияВСекундах;
				Движение.ЭлектронныйРесурс         = ЭлектронныйРесурс;
				Движение.СсылкаНаОбъектСУЗ         = СсылкаНаЭлемент;
				Движение.ПопыткаЗавершена          = ДанныеАктивности.complete;
				Движение.ДатаНачалаПрохождения     = ДанныеАктивности.start;
				Движение.ДатаОкончанияПрохождения  = ДанныеАктивности.end;
				Движение.ЭтоТест                   = Ложь;
				Движение.НомерРегистратора         = Номер;
				Движение.ВыставляетсяОценка        = Ложь;
				Движение.ЗавершеноВПроцентах       = ?(ДанныеАктивности.complete, 100, 0);		
				
			КонецЕсли;
			
			Если ДанныеАктивности.type = "QUIZ" Тогда
				
				Для каждого ДанныеТестирования Из ДанныеАктивности.quizAttempts Цикл
					
					Если НЕ ДанныеТестирования.complete Тогда
						Продолжить;
					КонецЕсли;
					
					Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
				
					Движение.Период = ДанныеТестирования.start;
					Движение.Пользователь = Пользователь;
					Движение.ПрохождениеОбучения = ПрохождениеОбучения;
					
					ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);
					
					Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
					Движение.ЭлементСодержания = ЭлементСодержания;

					Движение.Результат = ДанныеТестирования.score;
					
					Если Движение.Результат > 100 Тогда
						Движение.Результат = 100;
					КонецЕсли;		
					
					Движение.ВремяПрохожденияВСекундах = ДанныеТестирования.end - ДанныеТестирования.start;				
					Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
					Движение.СсылкаНаОбъектСУЗ = СсылкаНаЭлемент;
					Движение.ПопыткаЗавершена  =  ДанныеТестирования.complete;
					Движение.ДатаНачалаПрохождения     = ДанныеТестирования.start;
					Движение.ДатаОкончанияПрохождения  = ДанныеТестирования.end;
					Движение.ЭтоТест = Истина;
					Движение.НомерРегистратора = Номер;
					Движение.ВыставляетсяОценка = Истина;
					Движение.ЗавершеноВПроцентах = ?(ДанныеТестирования.complete, 100, 0);

					Если ДанныеТестирования.Свойство("requiredTeacher") Тогда
						Движение.ПроверяетсяПреподавателем = ДанныеТестирования.requiredTeacher;
					КонецЕсли;
					
					Если ДанныеТестирования.Свойство("checkTeacher") Тогда
						Движение.ПроверенПреподавателем = ДанныеТестирования.checkTeacher;
					КонецЕсли;		
					
					Движение.Сложность = Неопределено;
					
					Для каждого ДанныеСтраницыТеста Из ДанныеТестирования.pages Цикл
					
						Для каждого ДанныеОтветаНаВопрос Из ДанныеСтраницыТеста.questions Цикл
							
							Если НЕ ДанныеОтветаНаВопрос.complete Тогда
								Продолжить;
							КонецЕсли;
							
							ВопросТеста = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору("question", ДанныеОтветаНаВопрос.question);
							
							Движение = Движения.ВопросыТестированийСУЗ.Добавить();
							
							Движение.СессияВыполненияТеста = Ссылка;
							Движение.Вопрос = ВопросТеста;
							Движение.Вес = 1;
							Движение.ГруппаПодборки = ВопросТеста;														
														
							ПроведениеОбучения = Неопределено;
							
							Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
								ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(ПроведениеОбучения, ПрохождениеОбучения);
							КонецЕсли;			
							
							Движение = Движения.ОтветыНаВопросыСУЗ.Добавить();
								
							Движение.Период = ДанныеОтветаНаВопрос.start;
							Движение.Пользователь = Пользователь;
							Движение.Вопрос = ВопросТеста;
							Движение.ПрохождениеОбучения = ПрохождениеОбучения;
							Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
							Движение.ЭлементСодержания = ЭлементСодержания;
							
							Движение.Результат = ДанныеОтветаНаВопрос.score;
							
							Если Движение.Результат > 100 Тогда
								Движение.Результат = 100;
							КонецЕсли;		
							
							Движение.ПроведениеОбучения = ПроведениеОбучения;
							Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
							Движение.Тест = СсылкаНаЭлемент;
							
							Если ДанныеОтветаНаВопрос.Свойство("requiredTeacher") Тогда
								Движение.ПроверяетсяПреподавателем = ДанныеОтветаНаВопрос.requiredTeacher;
							КонецЕсли;
							
							Если ДанныеОтветаНаВопрос.Свойство("checkTeacher") Тогда
								Движение.ПроверенПреподавателем = ДанныеОтветаНаВопрос.checkTeacher;
							КонецЕсли;		
							
							Если ДанныеОтветаНаВопрос.Свойство("teacher") И ЗначениеЗаполнено(ДанныеОтветаНаВопрос.teacher) Тогда
								Движение.ПроверившийПреподаватель = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОтветаНаВопрос.teacher));
							КонецЕсли;
							
							Если ДанныеОтветаНаВопрос.Свойство("teacherComment") Тогда
								Движение.КомментарийПреподавателя = ДанныеОтветаНаВопрос.teacherComment;
							КонецЕсли;
							
							Движение.СессияВыполненияТеста = Ссылка;
							Движение.КоличествоПоказов     = 0; // Не поддерживается
							Движение.ИспользованаПодсказка = Ложь; // Не поддерживается
							Движение.ПсихологическийВопрос = Ложь; // Не поддерживается
													
							Если ДанныеОтветаНаВопрос.Свойство("fullAnswer") Тогда
								Движение.РазвернутыйОтветПользователя = ДанныеОтветаНаВопрос.fullAnswer;
							КонецЕсли;		
							
							НомерВариантаОтвета = 1;
							
							Для каждого ДанныеВариантаОтвета Из ДанныеОтветаНаВопрос.variants Цикл
																														
								Движение = Движения.ВыбранныеВариантыОтветовВопросовСУЗ.Добавить();
								
								Движение.Период = ДанныеОтветаНаВопрос.start;
								Движение.СессияВыполненияТеста = Ссылка;
								Движение.Пользователь = Пользователь;
								Движение.Вопрос = ВопросТеста;
								Движение.ВариантОтвета = Справочники.ВариантыОтветовНаВопросСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеВариантаОтвета.variant));
								
								Движение.ПрохождениеОбучения = ПрохождениеОбучения;
								Движение.ПроведениеОбучения = ПроведениеОбучения;			
								Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
								
								Движение.ЭлементСодержания = ЭлементСодержания;
								
								Движение.Выбран = ДанныеВариантаОтвета.selected;
								
								Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
								Движение.Тест = СсылкаНаЭлемент;
								Движение.Номер = НомерВариантаОтвета;
																		
								Движение.ВерныйВыбран = ДанныеВариантаОтвета.trueSelected;
								Движение.ВерныйНеВыбран = ДанныеВариантаОтвета.trueNotSelected;
								Движение.ОшибочныйВыбран = ДанныеВариантаОтвета.falseSelected;
								Движение.ОшибочныйНеВыбран = ДанныеВариантаОтвета.falseNotSelected;			
						
								НомерВариантаОтвета = НомерВариантаОтвета + 1;
						
							КонецЦикла;
							
							
						КонецЦикла;	
					
					КонецЦикла;
					
					Если ДанныеТестирования.Свойство("requiredTeacher") И ДанныеТестирования.requiredTeacher Тогда
						
						Движение = Движения.ТестыНаПроверкуСУЗ.Добавить();
						
						Движение.Период = ДанныеТестирования.start;
						Движение.Пользователь = Пользователь;
						Движение.ПрохождениеОбучения = ПрохождениеОбучения;
						Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
						Движение.ЭлементСодержания = ЭлементСодержания;
						Движение.Тест = СсылкаНаЭлемент;
						
						Если ДанныеТестирования.Свойство("checkTeacher") Тогда
							Движение.Проверен = ДанныеТестирования.checkTeacher;
						КонецЕсли;
						
						Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
						
					КонецЕсли;
					
					
					Если ДанныеТестирования.score < 100 Тогда
					
						АвтоРубрикатор = Справочники.РубрикаторыСУЗ.ПолучитьСсылку(ЭлектронныйРесурс.УникальныйИдентификатор());
					
						Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(АвтоРубрикатор, Ложь) Тогда		
							
							АвтоРубрики = РегистрыСведений.РубрикиОбъектовСУЗ.РубрикиЭлемента(АвтоРубрикатор, ВопросТеста);
							
							Для каждого АвтоРубрика Из АвтоРубрики Цикл
							
								Движение = Движения.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.Добавить();
								Движение.Период = ДанныеТестирования.start;
								Движение.Пользователь = Пользователь;
								Движение.ПрохождениеОбучения = ПрохождениеОбучения;
								Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
								Движение.ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(АвтоРубрика.УникальныйИдентификатор());
								
							КонецЦикла;			
							
						КонецЕсли;

					КонецЕсли;			
				
				КонецЦикла;
				
			КонецЕсли;
			
			Если ДанныеАктивности.type = "SCO" Тогда
				
				Для каждого ДанныеПопыткиSCO Из ДанныеАктивности.scoAttempts Цикл
										
					Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
					
					Движение.Период                 = ДанныеПопыткиSCO.start;
					Движение.Пользователь           = Пользователь;
					Движение.ПрохождениеОбучения    = ПрохождениеОбучения;
					Движение.Задание                = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
					Движение.ЭлектронныйРесурс      = ЭлектронныйРесурс;
					Движение.СсылкаНаОбъектСУЗ      = СсылкаНаЭлемент;
					Движение.ЭтоТест                   = Ложь;
					Движение.НомерРегистратора         = Номер;	
					
					ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);
					
					Движение.ЭлементСодержания = ЭлементСодержания;					
					Движение.ДатаНачалаПрохождения     = ДанныеПопыткиSCO.start;
					Движение.ДатаОкончанияПрохождения  = ДанныеПопыткиSCO.end;
					
					ЗаполнитьДвижениеПопыткиSCORM(Движение, ДанныеПопыткиSCO.cmi);
					
				КонецЦикла;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.course Тогда
	
		Движение = Движения.ПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
		
		Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
		Движение.Пользователь = Пользователь;
		Движение.ПрохождениеОбучения = ПрохождениеОбучения;
		Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
		Движение.ПлеерВебКабинета = Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Автономный;
		
		Если СтруктураДанных.Свойство("score") Тогда			
			
			Движение.Результат = СтруктураДанных.score;
			
			Если Движение.Результат > 100 Тогда
				Движение.Результат = 100;
			КонецЕсли;
			
		КонецЕсли;
		
		Движение.Завершено = СтруктураДанных.complete;
		
		Движение.КонтрольнаяСумма = КонтрольнаяСумма;
				
	КонецЕсли;
	
	Если ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.quiz Тогда
		
		// Движение по регистру ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		
		Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
		
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.ПрохождениеОбучения = ПрохождениеОбучения;
		
		ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);
		
		Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
		Движение.ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.item));

		Движение.Результат = СтруктураДанных.score;
		
		Если Движение.Результат > 100 Тогда
			Движение.Результат = 100;
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(СтруктураДанных.endDate) Тогда
			Движение.ВремяПрохожденияВСекундах = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.endDate) - ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.startDate);
		Иначе
			Движение.ВремяПрохожденияВСекундах = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.dateSave) - ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.startDate);
		КонецЕсли;
		
		Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
		Движение.СсылкаНаОбъектСУЗ = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(СтруктураДанных.nameObject, СтруктураДанных.collection);
		Движение.ПопыткаЗавершена  =  СтруктураДанных.complete;
		Движение.ДатаНачалаПрохождения = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.startDate);
		Движение.ДатаОкончанияПрохождения = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.endDate);
		Движение.ЭтоТест = Истина;
		Движение.НомерРегистратора = Номер;
		
		НазначениеТестирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.СсылкаНаОбъектСУЗ, "НазначениеТестирования");
		
		Если НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация Тогда
			Движение.ВыставляетсяОценка = Истина;
		Иначе
			Движение.ВыставляетсяОценка = Ложь;
		КонецЕсли;
		
		Движение.ЗавершеноВПроцентах = ?(СтруктураДанных.complete, 100, 0);

		Если СтруктураДанных.Свойство("requiredTeacher") Тогда
			Движение.ПроверяетсяПреподавателем = СтруктураДанных.requiredTeacher;
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("checkTeacher") Тогда
			Движение.ПроверенПреподавателем = СтруктураДанных.checkTeacher;
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(СтруктураДанных.level) И СтруктураДанных.level <> "default" Тогда
			Движение.Сложность = Справочники.СложностиТестовСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.level));
		КонецЕсли;
		
		// Движение по регистру ВопросыТестированийСУЗ
		
		Если СтруктураДанных.Свойство("pages") Тогда
		
			Для каждого page Из СтруктураДанных.pages Цикл
				
				ГруппаПодборки = Неопределено;
				
				Если page.Свойство("type") Тогда
				
					Если page.type = "group" Тогда
						ГруппаПодборки = Справочники.ЭлементыПодборкиСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(page.id));
					КонецЕсли;
					
					Если page.type = "question" Тогда
						ГруппаПодборки = Справочники.ВопросыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(page.id));
					КонецЕсли;
					
				КонецЕсли;
					
				Для каждого question Из page.questions Цикл
				
					Движение = Движения.ВопросыТестированийСУЗ.Добавить();
					
					Движение.СессияВыполненияТеста = Ссылка;
					Движение.Вопрос = Справочники.ВопросыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(question.id));
					Движение.Вес = question.weight;
					Движение.ГруппаПодборки = ГруппаПодборки;				
				
				КонецЦикла;
			
			КонецЦикла;
			
		КонецЕсли;
		
		// Движение по регистру ТестыНаПроверкуСУЗ
		
		Если СтруктураДанных.Свойство("requiredTeacher") И СтруктураДанных.requiredTeacher Тогда
			
			Движение = Движения.ТестыНаПроверкуСУЗ.Добавить();
			
			Движение.Период = Дата;
			Движение.Пользователь = Пользователь;
			Движение.ПрохождениеОбучения = ПрохождениеОбучения;
			Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
			Движение.ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.item));
			Движение.Тест = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(СтруктураДанных.nameObject, СтруктураДанных.collection);
			
			Если СтруктураДанных.Свойство("checkTeacher") Тогда
				Движение.Проверен = СтруктураДанных.checkTeacher;
			КонецЕсли;
			
			Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
			
		КонецЕсли;
			
		
	КонецЕсли;
	
	Если ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.answerQuestion
		И СтруктураДанных.complete Тогда
		
		// Получаем необходимые данные
		
		Вопрос = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору("question", СтруктураДанных.question);
		
		ПроведениеОбучения = Неопределено;
		
		Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
			ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(ПроведениеОбучения, ПрохождениеОбучения);
		КонецЕсли;			
		
		Если СтруктураДанных.Свойство("item") Тогда
			ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.item));
		Иначе
			ЭлементСодержания = Неопределено;
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("collection") Тогда
			Тест = Справочники.ПодборкиСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.collection));
		Иначе
			Тест = Неопределено;
		КонецЕсли;		
		
		// Движения по ОтветыНаВопросыСУЗ
		
		Движение = Движения.ОтветыНаВопросыСУЗ.Добавить();
		
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.Вопрос = Вопрос;
		Движение.ПрохождениеОбучения = ПрохождениеОбучения;
		Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
		Движение.ЭлементСодержания = ЭлементСодержания;
		
		Движение.Результат = СтруктураДанных.score;
		
		Если Движение.Результат > 100 Тогда
			Движение.Результат = 100;
		КонецЕсли;		
		
		Движение.ПроведениеОбучения = ПроведениеОбучения;
		Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
		Движение.Тест = Тест;
		
		Если СтруктураДанных.Свойство("requiredTeacher") Тогда
			Движение.ПроверяетсяПреподавателем = СтруктураДанных.requiredTeacher;
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("checkTeacher") Тогда
			Движение.ПроверенПреподавателем = СтруктураДанных.checkTeacher;
		КонецЕсли;		
		
		Если СтруктураДанных.Свойство("teacher") И ЗначениеЗаполнено(СтруктураДанных.teacher) Тогда
			Движение.ПроверившийПреподаватель = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.teacher));
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("teacherComment") Тогда
			Движение.КомментарийПреподавателя = СтруктураДанных.teacherComment;
		КонецЕсли;
		
		Движение.СессияВыполненияТеста = РодительскаяСессия;
		Движение.КоличествоПоказов     = СтруктураДанных.countShows;
		Движение.ИспользованаПодсказка = СтруктураДанных.helpIsUsed;
		
		Если СтруктураДанных.Свойство("isPsychologic") Тогда
			Движение.ПсихологическийВопрос = СтруктураДанных.isPsychologic;
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("fullAnswer") Тогда
			Движение.РазвернутыйОтветПользователя = СтруктураДанных.fullAnswer;
		КонецЕсли;		
		
		Если СтруктураДанных.Свойство("textAnswers")
			И ТипЗнч(СтруктураДанных.textAnswers) = Тип("Структура") Тогда
			
			Для каждого ОтветПоШаблону Из СтруктураДанных.textAnswers Цикл
			
				Движение.РазвернутыйОтветПользователя = Движение.РазвернутыйОтветПользователя + ОтветПоШаблону.Значение + " ";
			
			КонецЦикла;
			
		КонецЕсли;
		
		// Движения по ВыбранныеВариантыОтветовВопросовСУЗ
		
		Для каждого Строка Из СтруктураДанных.variants Цикл
		
			Движение = Движения.ВыбранныеВариантыОтветовВопросовСУЗ.Добавить();
			
			Движение.Период = Дата;
			Движение.СессияВыполненияТеста = РодительскаяСессия;
			Движение.Пользователь = Пользователь;
			Движение.Вопрос = Вопрос;
			Движение.ВариантОтвета = Справочники.ВариантыОтветовНаВопросСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.id));
			
			Движение.ПрохождениеОбучения = ПрохождениеОбучения;
			Движение.ПроведениеОбучения = ПроведениеОбучения;			
			Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
			
			Движение.ЭлементСодержания = ЭлементСодержания;
			
			Движение.Выбран = Строка.selected;
			
			Движение.ЭлектронныйРесурс = ЭлектронныйРесурс;
			Движение.Тест = Тест;
			
			Если Строка.Свойство("number") Тогда
				Движение.Номер = Строка.number;
			КонецЕсли;
		
			Движение.ВерныйВыбран = Строка.trueSelected;
			Движение.ВерныйНеВыбран = Строка.trueNotSelected;
			Движение.ОшибочныйВыбран = Строка.falseSelected;
			Движение.ОшибочныйНеВыбран = Строка.falseNotSelected;			
		
		КонецЦикла;
		
		// Движение по ПовторноеПрохождениеЭлектронныхРесурсовСУЗ
		
		Если СтруктураДанных.score < 100 Тогда
		
			АвтоРубрикатор = Справочники.РубрикаторыСУЗ.ПолучитьСсылку(ЭлектронныйРесурс.УникальныйИдентификатор());
		
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(АвтоРубрикатор, Ложь) Тогда		
				
				АвтоРубрики = РегистрыСведений.РубрикиОбъектовСУЗ.РубрикиЭлемента(АвтоРубрикатор, Вопрос);
				
				Для каждого АвтоРубрика Из АвтоРубрики Цикл
				
					Движение = Движения.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.Добавить();
					Движение.Период = Дата;
					Движение.Пользователь = Пользователь;
					Движение.ПрохождениеОбучения = ПрохождениеОбучения;
					Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
					Движение.ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(АвтоРубрика.УникальныйИдентификатор());
					
				КонецЦикла;			
				
			КонецЕсли;

		КонецЕсли;			
		
	КонецЕсли;		
	
	Если ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.staticPage
		И СтруктураДанных.Свойство("nameObject") Тогда
		
		// Примечание: могут быть ситуации, когда свойства nameObject нет,
		// так как нет объекта, на который был выполнен переход в курсе.
		
		Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
		
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.ПрохождениеОбучения = ПрохождениеОбучения;
		ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);
		Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
		
		Если СтруктураДанных.nameObject <> "knowledgeBase" И ЗначениеЗаполнено(СтруктураДанных.item) Тогда
			Движение.ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.item));
		КонецЕсли;
		
		Если СтруктураДанных.complete Тогда
			Движение.Результат = 100;
		Иначе
			Движение.Результат = 0;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.endDate) Тогда
			Движение.ВремяПрохожденияВСекундах = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.endDate) - ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.startDate);
		Иначе
			Движение.ВремяПрохожденияВСекундах = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.dateSave) - ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.startDate);
		КонецЕсли;
		
		Движение.ЭлектронныйРесурс         = ЭлектронныйРесурс;
		Движение.СсылкаНаОбъектСУЗ         = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(СтруктураДанных.nameObject, СтруктураДанных.idObject);
		Движение.ПопыткаЗавершена          = СтруктураДанных.complete;
		Движение.ДатаНачалаПрохождения     = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.startDate);
		Движение.ДатаОкончанияПрохождения  = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.endDate);
		Движение.ЭтоТест                   = Ложь;
		Движение.НомерРегистратора         = Номер;
		Движение.ВыставляетсяОценка        = Ложь;
		Движение.ЗавершеноВПроцентах       = ?(СтруктураДанных.complete, 100, 0);
		
	КонецЕсли;
	
	Если ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.SCOPage Тогда
		
		Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
		
		Движение.Период                 = Дата;
		Движение.Пользователь           = Пользователь;
		Движение.ПрохождениеОбучения    = ПрохождениеОбучения;
		Движение.Задание                = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание);
		Движение.ЭлектронныйРесурс      = ЭлектронныйРесурс;
		Движение.СсылкаНаОбъектСУЗ      = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору("res", СтруктураДанных.idObject);
		Движение.ЭтоТест                = Ложь;
		Движение.НомерРегистратора      = Номер;
		
		ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);
		
		Если ЗначениеЗаполнено(СтруктураДанных.item) Тогда
			Движение.ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.item));
		КонецЕсли;
		
		Движение.ДатаНачалаПрохождения     = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.startDate);
		Движение.ДатаОкончанияПрохождения  = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(СтруктураДанных.endDate);
		
		ЗаполнитьДвижениеПопыткиSCORM(Движение, СтруктураДанных);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрSCORMИспользуется(НастройкиПакетаSCORM, Параметр)
	
	
	СтрокаТН = НастройкиПакетаSCORM.ТаблицаНастроек.Найти(Параметр, "Параметр");
	
	Если СтрокаТН = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат СтрокаТН.Используется;
	
КонецФункции

Процедура ЗаполнитьДвижениеПопыткиSCORM(Движение, ДанныеПопыткиSCO) Экспорт
	
	// Заполняем таблицу
	//
	
	ТаблицаСтатистикиПараметровSCORM = Перечисления.ИспользуемыеПараметрыSCORM.НоваяТаблицаСтатистикиПараметровSCORM();
	
	Если ДополнительныеСвойства.Свойство("ЭтоПолучениеСтатистикиSCORM")
		И ДополнительныеСвойства.ЭтоПолучениеСтатистикиSCORM Тогда
		НастройкиПакетаSCORM  = Справочники.РесурсыСУЗ.НастройкиSCORMДляПолученияСтатистики();
	Иначе
		НастройкиПакетаSCORM  = Справочники.РесурсыСУЗ.НастройкиПакетаSCORM(Движение.СсылкаНаОбъектСУЗ);
	КонецЕсли;	
	
	// Завершено
	
	ЗавершеноПередано = Ложь;
	ЗавершеноПереданоСОшибкой = Ложь;
	ЗавершеноЗначениеПеречисления = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеПопыткиSCO.completion_status)
		И ПараметрSCORMИспользуется(НастройкиПакетаSCORM, Перечисления.ИспользуемыеПараметрыSCORM.completion_status) Тогда
		
		ЗавершеноПередано = Истина;
		
		Попытка
			ЗавершеноЗначениеПеречисления = Перечисления.СостоянияВыполненияОбъектовSCORM[ДанныеПопыткиSCO.completion_status];
		Исключение
			ЗавершеноПереданоСОшибкой = Истина
		КонецПопытки;
		
	КонецЕсли;
	
	Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
		ТаблицаСтатистикиПараметровSCORM,
		ЭлектронныйРесурс,
		Движение.ЭлементСодержания,
		Перечисления.ИспользуемыеПараметрыSCORM.completion_status,
		ЗавершеноПередано,
		ЗавершеноПереданоСОшибкой,
		ДанныеПопыткиSCO.completion_status);						
	
	// Оценка
	
	РезультатВПроцентах = 0;
	РезультатПередан = Ложь;
	РезультатПереданСОшибкой = Ложь;
	
	Если (ЗначениеЗаполнено(ДанныеПопыткиSCO.score.scaled)
		ИЛИ ЗначениеЗаполнено(ДанныеПопыткиSCO.score.min)
		ИЛИ ЗначениеЗаполнено(ДанныеПопыткиSCO.score.max)
		ИЛИ ЗначениеЗаполнено(ДанныеПопыткиSCO.score.raw))
		И ПараметрSCORMИспользуется(НастройкиПакетаSCORM, Перечисления.ИспользуемыеПараметрыSCORM.score) Тогда
		
		РезультатПередан = Истина;						

		Если ЗначениеЗаполнено(ДанныеПопыткиSCO.score.scaled) Тогда
			
			РезультатПередан = Истина;
			
			Попытка
				РезультатВПроцентах = Число(ДанныеПопыткиSCO.score.scaled);
			Исключение
				РезультатПереданСОшибкой = Истина;
			КонецПопытки;				
			
		Иначе
			
			Попытка
				Если (ДанныеПопыткиSCO.score.min + ДанныеПопыткиSCO.score.max) > 0 Тогда
					РезультатВПроцентах = (ДанныеПопыткиSCO.score.raw / (ДанныеПопыткиSCO.score.min + ДанныеПопыткиSCO.score.max));
				КонецЕсли;			
			Исключение
				РезультатПереданСОшибкой = Истина;
			КонецПопытки;				
			
		КонецЕсли;
		
	КонецЕсли;					
					
	Если РезультатВПроцентах < 0 Тогда
		РезультатВПроцентах = 0;
		РезультатПереданСОшибкой = Истина;
	КонецЕсли;			
	
	Если РезультатВПроцентах > 1 Тогда
		РезультатВПроцентах = 1;
		РезультатПереданСОшибкой = Истина;
	КонецЕсли;						
	
	Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
		ТаблицаСтатистикиПараметровSCORM,
		ЭлектронныйРесурс,
		Движение.ЭлементСодержания,
		Перечисления.ИспользуемыеПараметрыSCORM.score,
		РезультатПередан,
		РезультатПереданСОшибкой,
		ДанныеПопыткиSCO.score); 
		
	РезультатВПроцентах = РезультатВПроцентах * 100;
		
	// Прогресс
	
	ПрогрессПередан = Ложь;
	ПрогрессПереданСОшибкой = Ложь;
	ЗавершеноВПроцентах = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеПопыткиSCO.progress_measure)
		И ПараметрSCORMИспользуется(НастройкиПакетаSCORM, Перечисления.ИспользуемыеПараметрыSCORM.progress_measure) Тогда
		
		ПрогрессПередан = Истина;
		Если ОбщегоНазначенияСУКлиентСервер.ЭтоЧисло(ДанныеПопыткиSCO.progress_measure) Тогда
			ЗавершеноВПроцентах = Число(ДанныеПопыткиSCO.progress_measure) * 100;
		Иначе
			ЗавершеноВПроцентах = 0;
			ПрогрессПереданСОшибкой = Истина;
		КонецЕсли;
		Если ЗавершеноВПроцентах > 100 Тогда
			ЗавершеноВПроцентах = 100;
			ПрогрессПереданСОшибкой = Истина;
		КонецЕсли;
		Если ЗавершеноВПроцентах < 0 Тогда
			ЗавершеноВПроцентах = 0;
			ПрогрессПереданСОшибкой = Истина;
		КонецЕсли;
		
	Иначе
		ЗавершеноВПроцентах = 0;
	КонецЕсли;
	
	Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
		ТаблицаСтатистикиПараметровSCORM,
		ЭлектронныйРесурс,
		Движение.ЭлементСодержания,
		Перечисления.ИспользуемыеПараметрыSCORM.progress_measure,
		ПрогрессПередан,
		ПрогрессПереданСОшибкой,
		ДанныеПопыткиSCO.progress_measure);
							
	// Время сессии
	
	ВремяСессииПередано = Ложь;
	ВремяСессииПереданоСОшибкой = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеПопыткиSCO.session_time)
		И ПараметрSCORMИспользуется(НастройкиПакетаSCORM, Перечисления.ИспользуемыеПараметрыSCORM.session_time) Тогда
		
		ВремяСессииПередано = Истина;

		Попытка
			ОбъектыSCORM.ПолучитьКоличествоСекундВременногоИнтервалаSCORM(ДанныеПопыткиSCO.session_time);
		Исключение
			ВремяСессииПереданоСОшибкой = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
		ТаблицаСтатистикиПараметровSCORM,
		ЭлектронныйРесурс,
		Движение.ЭлементСодержания,
		Перечисления.ИспользуемыеПараметрыSCORM.session_time,
		ВремяСессииПередано,
		ВремяСессииПереданоСОшибкой,
		ДанныеПопыткиSCO.session_time);						
	
	// Выход
	
	ВыходПередан = Ложь;
	ВыходЗначение = "suspend";
	
	Если ПараметрSCORMИспользуется(НастройкиПакетаSCORM, Перечисления.ИспользуемыеПараметрыSCORM.exit) Тогда		
		ВыходПередан = Истина;
		ВыходЗначение = ДанныеПопыткиSCO.exit;	
	КонецЕсли;
	
	Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
		ТаблицаСтатистикиПараметровSCORM,
		ЭлектронныйРесурс,
		Движение.ЭлементСодержания,
		Перечисления.ИспользуемыеПараметрыSCORM.exit,
		ВыходПередан,
		Ложь,
		ДанныеПопыткиSCO.exit);
	
	// Успех
	
	УспехПередан = Ложь;
	УспехПереданСОшибкой = Ложь;
	УспехЗначениеПеречисления = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеПопыткиSCO.success_status)
		И ПараметрSCORMИспользуется(НастройкиПакетаSCORM, Перечисления.ИспользуемыеПараметрыSCORM.success_status) Тогда
		
		УспехПередан = Истина;
		
		Попытка
			УспехЗначениеПеречисления = Перечисления.СостоянияПрохожденияОбъектовSCORM[ДанныеПопыткиSCO.success_status];
		Исключение
			УспехПереданСОшибкой = Истина;
		КонецПопытки;						
		
	КонецЕсли;					

	Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
		ТаблицаСтатистикиПараметровSCORM,
		ЭлектронныйРесурс,
		Движение.ЭлементСодержания,
		Перечисления.ИспользуемыеПараметрыSCORM.success_status,
		УспехПередан,
		УспехПереданСОшибкой,
		ДанныеПопыткиSCO.success_status);		
		
	// Заполняем движения
	//
	
	// ПопыткаЗавершена
	
	ПопыткаЗавершена = Ложь;
	
	Если ЗавершеноПередано И НЕ ЗавершеноПереданоСОшибкой Тогда
		Если ЗавершеноЗначениеПеречисления = Перечисления.СостоянияВыполненияОбъектовSCORM.completed Тогда			
			ПопыткаЗавершена = Истина;
		КонецЕсли;
	Иначе
		Если УспехПередан И НЕ УспехПереданСОшибкой Тогда
			Если УспехЗначениеПеречисления = Перечисления.СостоянияПрохожденияОбъектовSCORM.failed
				ИЛИ УспехЗначениеПеречисления = Перечисления.СостоянияПрохожденияОбъектовSCORM.passed Тогда
				ПопыткаЗавершена = Истина;
			КонецЕсли;
		КонецЕсли;
		Если ПрогрессПередан И НЕ ПрогрессПереданСОшибкой Тогда
			Если ЗавершеноВПроцентах = 100 Тогда
				ПопыткаЗавершена = Истина;
			КонецЕсли;
		КонецЕсли;
		Если РезультатПередан И НЕ РезультатПереданСОшибкой Тогда
			ПопыткаЗавершена = Истина;	
		КонецЕсли;
	КонецЕсли;
	
	Если ВыходПередан Тогда
		Если ВыходЗначение = "suspend" Тогда
			ПопыткаЗавершена = Ложь;
		Иначе
			ПопыткаЗавершена = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Движение.ПопыткаЗавершена = ПопыткаЗавершена;

	// ВыставляетсяОценка
	
	Движение.ВыставляетсяОценка = ?(РезультатПередан И НЕ РезультатПереданСОшибкой, Истина, Ложь);	
	
	// Результат
	
	Движение.Результат = 0;
	
	Если ПопыткаЗавершена Тогда
		Если Движение.ВыставляетсяОценка Тогда
			Движение.Результат = РезультатВПроцентах;		
		Иначе
			Движение.Результат = 100;
		КонецЕсли;
	КонецЕсли;
	
	// Завершено в процентах
	
	Если Движение.ПопыткаЗавершена Тогда
		Движение.ЗавершеноВПроцентах = 100;
	Иначе
		Если ПрогрессПередан И НЕ ПрогрессПереданСОшибкой Тогда
			Движение.ЗавершеноВПроцентах = ЗавершеноВПроцентах;	
		Иначе
			Движение.ЗавершеноВПроцентах = 0;
		КонецЕсли;
	КонецЕсли;
	
	// ВремяПрохожденияВСекундах
	
	Движение.ВремяПрохожденияВСекундах = 0;
	
	Если ВремяСессииПередано И НЕ ВремяСессииПереданоСОшибкой Тогда
		Если ДанныеПопыткиSCO.Свойство("total_time") Тогда
			Движение.ВремяПрохожденияВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундВременногоИнтервалаSCORM(ДанныеПопыткиSCO.total_time);
		КонецЕсли;
		Если ДанныеПопыткиSCO.Свойство("total_time_sec") Тогда
			Движение.ВремяПрохожденияВСекундах = ДанныеПопыткиSCO.total_time_sec / 100; // Сантисекунды в секунды
		КонецЕсли;
	Иначе		
		Если ДанныеПопыткиSCO.Свойство("historySessions") Тогда			
			Для каждого ДанныеСессии Из ДанныеПопыткиSCO.historySessions Цикл
				Если НЕ ДанныеСессии.Свойство("startDate") Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ДанныеСессии.startDate) Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ ДанныеСессии.Свойство("endDate") Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ДанныеСессии.endDate) Тогда
					Продолжить;
				КонецЕсли;				
				Движение.ВремяПрохожденияВСекундах = Движение.ВремяПрохожденияВСекундах
					+ Окр((ДанныеСессии.endDate - ДанныеСессии.startDate) / 1000);				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
